node {
  name: "Variable/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "Variable"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Variable/Assign"
  op: "Assign"
  input: "Variable"
  input: "Variable/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Variable"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Variable/read"
  op: "Identity"
  input: "Variable"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Variable"
      }
    }
  }
}
node {
  name: "mul/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.899999976158
      }
    }
  }
}
node {
  name: "mul"
  op: "Mul"
  input: "Variable/read"
  input: "mul/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Assign"
  op: "Assign"
  input: "Variable"
  input: "mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Variable"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "encoder0"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "encoder1"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "encoder2"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "encoder3"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "encoder4"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "decoder0"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "decoder1"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "decoder2"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "decoder3"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "decoder4"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "decoder5"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "weight0"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "weight1"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "weight2"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "weight3"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "weight4"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/Shape"
  op: "Shape"
  input: "encoder0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/strided_slice"
  op: "StridedSlice"
  input: "embedding_attention_seq2seq/rnn/Shape"
  input: "embedding_attention_seq2seq/rnn/strided_slice/stack"
  input: "embedding_attention_seq2seq/rnn/strided_slice/stack_1"
  input: "embedding_attention_seq2seq/rnn/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/ExpandDims"
  op: "ExpandDims"
  input: "embedding_attention_seq2seq/rnn/strided_slice"
  input: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 8
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/concat/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/concat"
  op: "ConcatV2"
  input: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/ExpandDims"
  input: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/Const"
  input: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/concat/axis"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/zeros/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/zeros"
  op: "Fill"
  input: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/concat"
  input: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/zeros/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/ExpandDims_1/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/ExpandDims_1"
  op: "ExpandDims"
  input: "embedding_attention_seq2seq/rnn/strided_slice"
  input: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/ExpandDims_1/dim"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 8
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/ExpandDims_2/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/ExpandDims_2"
  op: "ExpandDims"
  input: "embedding_attention_seq2seq/rnn/strided_slice"
  input: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/ExpandDims_2/dim"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 8
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/concat_1/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/concat_1"
  op: "ConcatV2"
  input: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/ExpandDims_2"
  input: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/Const_2"
  input: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/concat_1/axis"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/zeros_1/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/zeros_1"
  op: "Fill"
  input: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/concat_1"
  input: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/zeros_1/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/ExpandDims_3/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/ExpandDims_3"
  op: "ExpandDims"
  input: "embedding_attention_seq2seq/rnn/strided_slice"
  input: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/ExpandDims_3/dim"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 8
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/embedding_wrapper/embedding/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@embedding_attention_seq2seq/rnn/embedding_wrapper/embedding"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "Z\000\000\000\010\000\000\000"
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/embedding_wrapper/embedding/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@embedding_attention_seq2seq/rnn/embedding_wrapper/embedding"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -1.73205077648
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/embedding_wrapper/embedding/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@embedding_attention_seq2seq/rnn/embedding_wrapper/embedding"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.73205077648
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/embedding_wrapper/embedding/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "embedding_attention_seq2seq/rnn/embedding_wrapper/embedding/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@embedding_attention_seq2seq/rnn/embedding_wrapper/embedding"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/embedding_wrapper/embedding/Initializer/random_uniform/sub"
  op: "Sub"
  input: "embedding_attention_seq2seq/rnn/embedding_wrapper/embedding/Initializer/random_uniform/max"
  input: "embedding_attention_seq2seq/rnn/embedding_wrapper/embedding/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@embedding_attention_seq2seq/rnn/embedding_wrapper/embedding"
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/embedding_wrapper/embedding/Initializer/random_uniform/mul"
  op: "Mul"
  input: "embedding_attention_seq2seq/rnn/embedding_wrapper/embedding/Initializer/random_uniform/RandomUniform"
  input: "embedding_attention_seq2seq/rnn/embedding_wrapper/embedding/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@embedding_attention_seq2seq/rnn/embedding_wrapper/embedding"
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/embedding_wrapper/embedding/Initializer/random_uniform"
  op: "Add"
  input: "embedding_attention_seq2seq/rnn/embedding_wrapper/embedding/Initializer/random_uniform/mul"
  input: "embedding_attention_seq2seq/rnn/embedding_wrapper/embedding/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@embedding_attention_seq2seq/rnn/embedding_wrapper/embedding"
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/embedding_wrapper/embedding"
  op: "VariableV2"
  device: "/device:CPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@embedding_attention_seq2seq/rnn/embedding_wrapper/embedding"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 90
        }
        dim {
          size: 8
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/embedding_wrapper/embedding/Assign"
  op: "Assign"
  input: "embedding_attention_seq2seq/rnn/embedding_wrapper/embedding"
  input: "embedding_attention_seq2seq/rnn/embedding_wrapper/embedding/Initializer/random_uniform"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@embedding_attention_seq2seq/rnn/embedding_wrapper/embedding"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/embedding_wrapper/embedding/read"
  op: "Identity"
  input: "embedding_attention_seq2seq/rnn/embedding_wrapper/embedding"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/Reshape/shape"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/Reshape"
  op: "Reshape"
  input: "encoder0"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/Reshape/shape"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/embedding_lookup"
  op: "Gather"
  input: "embedding_attention_seq2seq/rnn/embedding_wrapper/embedding/read"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/Reshape"
  device: "/device:CPU:0"
  attr {
    key: "Tindices"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tparams"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@embedding_attention_seq2seq/rnn/embedding_wrapper/embedding/read"
      }
    }
  }
  attr {
    key: "validate_indices"
    value {
      b: true
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\020\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.353553384542
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.353553384542
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/kernel/Initializer/random_uniform/max"
  input: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/kernel"
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/kernel/Initializer/random_uniform/RandomUniform"
  input: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/kernel"
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/kernel/Initializer/random_uniform"
  op: "Add"
  input: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/kernel/Initializer/random_uniform/mul"
  input: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/kernel"
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/kernel"
  op: "VariableV2"
  device: "/device:CPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/kernel/Assign"
  op: "Assign"
  input: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/kernel"
  input: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/kernel/Initializer/random_uniform"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/kernel/read"
  op: "Identity"
  input: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/kernel"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/bias/Initializer/zeros/shape_as_tensor"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 32
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/bias/Initializer/zeros/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/bias/Initializer/zeros"
  op: "Fill"
  input: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/bias/Initializer/zeros/shape_as_tensor"
  input: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/bias/Initializer/zeros/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/bias"
      }
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/bias"
  op: "VariableV2"
  device: "/device:CPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/bias"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/bias/Assign"
  op: "Assign"
  input: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/bias"
  input: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/bias/Initializer/zeros"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/bias/read"
  op: "Identity"
  input: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/bias"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Const"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/concat/axis"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/concat"
  op: "ConcatV2"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/embedding_lookup"
  input: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/zeros_1"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/concat/axis"
  device: "/device:CPU:0"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/MatMul"
  op: "MatMul"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/concat"
  input: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/kernel/read"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/BiasAdd"
  op: "BiasAdd"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/MatMul"
  input: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/bias/read"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Const_1"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 4
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/split"
  op: "Split"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Const"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/BiasAdd"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "num_split"
    value {
      i: 4
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Const_2"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Add"
  op: "Add"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/split:2"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Const_2"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Sigmoid"
  op: "Sigmoid"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Add"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Mul"
  op: "Mul"
  input: "embedding_attention_seq2seq/rnn/EmbeddingWrapperZeroState/BasicLSTMCellZeroState/zeros"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Sigmoid"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Sigmoid_1"
  op: "Sigmoid"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/split"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Tanh"
  op: "Tanh"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/split:1"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Mul_1"
  op: "Mul"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Sigmoid_1"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Tanh"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Add_1"
  op: "Add"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Mul"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Mul_1"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Tanh_1"
  op: "Tanh"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Add_1"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Sigmoid_2"
  op: "Sigmoid"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/split:3"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Mul_2"
  op: "Mul"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Tanh_1"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Sigmoid_2"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/Reshape_1/shape"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/Reshape_1"
  op: "Reshape"
  input: "encoder1"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/Reshape_1/shape"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/embedding_lookup_1"
  op: "Gather"
  input: "embedding_attention_seq2seq/rnn/embedding_wrapper/embedding/read"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/Reshape_1"
  device: "/device:CPU:0"
  attr {
    key: "Tindices"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tparams"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@embedding_attention_seq2seq/rnn/embedding_wrapper/embedding/read"
      }
    }
  }
  attr {
    key: "validate_indices"
    value {
      b: true
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Const_3"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/concat_1/axis"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/concat_1"
  op: "ConcatV2"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/embedding_lookup_1"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Mul_2"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/concat_1/axis"
  device: "/device:CPU:0"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/MatMul_1"
  op: "MatMul"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/concat_1"
  input: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/kernel/read"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/BiasAdd_1"
  op: "BiasAdd"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/MatMul_1"
  input: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/bias/read"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Const_4"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 4
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/split_1"
  op: "Split"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Const_3"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/BiasAdd_1"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "num_split"
    value {
      i: 4
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Const_5"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Add_2"
  op: "Add"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/split_1:2"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Const_5"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Sigmoid_3"
  op: "Sigmoid"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Add_2"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Mul_3"
  op: "Mul"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Add_1"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Sigmoid_3"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Sigmoid_4"
  op: "Sigmoid"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/split_1"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Tanh_2"
  op: "Tanh"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/split_1:1"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Mul_4"
  op: "Mul"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Sigmoid_4"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Tanh_2"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Add_3"
  op: "Add"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Mul_3"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Mul_4"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Tanh_3"
  op: "Tanh"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Add_3"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Sigmoid_5"
  op: "Sigmoid"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/split_1:3"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Mul_5"
  op: "Mul"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Tanh_3"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Sigmoid_5"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/Reshape_2/shape"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/Reshape_2"
  op: "Reshape"
  input: "encoder2"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/Reshape_2/shape"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/embedding_lookup_2"
  op: "Gather"
  input: "embedding_attention_seq2seq/rnn/embedding_wrapper/embedding/read"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/Reshape_2"
  device: "/device:CPU:0"
  attr {
    key: "Tindices"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tparams"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@embedding_attention_seq2seq/rnn/embedding_wrapper/embedding/read"
      }
    }
  }
  attr {
    key: "validate_indices"
    value {
      b: true
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Const_6"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/concat_2/axis"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/concat_2"
  op: "ConcatV2"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/embedding_lookup_2"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/Mul_5"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/concat_2/axis"
  device: "/device:CPU:0"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/MatMul_2"
  op: "MatMul"
  input: "embedding_attention_seq2seq/rnn/rnn/embedding_wrapper/basic_lstm_cell/concat_2"
  input: "embedding_attention_seq2seq/rnn/embedding_wrapper/basic_lstm_cell/kernel/read"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
